{"sections":{"16551852697ebd58a0":{"type":"packages-info","disabled":true,"settings":{"image_background":"shopify:\/\/shop_images\/Group_139.jpg","title":"<p>Welzo is about empowering personal health!<\/p>","text1":"<p>Our mission at Welzo is to empower individuals to take control of their health and wellbeing through our convenient and accessible online platform. We are committed to providing a wide range of healthcare support, home health tests, and over-the-counter health and beauty products that are affordable, reliable, and easy to use. Our goal is to make it easy for everyone to access the resources they need to live their healthiest life possible, and to do so with compassion, integrity, and respect. At Welzo, we believe that everyone deserves the opportunity to achieve optimal health and wellbeing, and we are dedicated to making that a reality for all of our customers.<\/p>","text2":"<p>At Welzo, we are committed to improving health outcomes and promoting wellness for individuals and communities. We believe that by providing access to affordable and convenient healthcare support, we can help our customers take control of their health and live their best life. Our mission is to make healthcare accessible to everyone, and we will continue to innovate and improve our platform to better serve the needs of our customers.<\/p>","padding_top":100,"padding_bottom":100}},"d69501c2-f17b-4526-bcc9-73d31895ba73":{"type":"simple_text","blocks":{"template--15775868125277__d69501c2-f17b-4526-bcc9-73d31895ba73-heading-1":{"type":"heading","settings":{"heading":"Pharmacy Information"}},"template--15775868125277__d69501c2-f17b-4526-bcc9-73d31895ba73-text-1":{"type":"text","settings":{"text":"<p><span style=\"text-decoration:underline\"><strong>Pharmacy Details<\/strong><\/span><\/p><p>We work with the following registered pharmacy which:<\/p><p>Employs or engages registered pharmacist independent prescribers, who undertake online telehealth medical consultations, provide the medical Services and issue private prescriptions; and<\/p><p>Supplies and dispatches products that you obtain via the Site:<\/p><p>Online Express Medicines Ltd is registered with the General Pharmaceutical Council with number 9010764. Online Express Medicines provides the pharmacy services. <\/p><p>The Superintendent Pharmacist is Umash Patel, GPhC Number 2082416.<\/p><p>You can verify their registration with GPHC by <a href=\"https:\/\/www.pharmacyregulation.org\/registers\/pharmacy\/name\/simply%2Bmeds%2Bonline\" title=\"https:\/\/www.pharmacyregulation.org\/registers\/pharmacy\/name\/simply%2Bmeds%2Bonline\">clicking here.<br\/><br\/><\/a><span style=\"text-decoration:underline\"><strong>Pharmacy Address<\/strong><\/span><\/p><p>Unit K2 Beckingham Business Park. Beckingham Street, Tolleshunt Major CM9 8LZ<\/p><p><strong>Useful Links<\/strong><\/p><p>MHRA - Medicines and Healthcare products regulatory Agency<\/p><p>It is the Executive Agency of the Department of Health in the United Kingdom, protecting and promoting public health and patient safety by ensuring that medicines, healthcare products and medical equipment meet appropriate standards of safety, quality, performance and effectiveness, and are used safely.<\/p><p><a href=\"https:\/\/www.gov.uk\/government\/organisations\/medicines-and-healthcare-products-regulatory-agency\"><span style=\"text-decoration:underline\">https:\/\/www.gov.uk\/government\/organisations\/medicines-and-healthcare-products-regulatory-agency<\/span><\/a><\/p><p>GPhC – General Pharmaceutical Council<\/p><p>The GPhC regulate pharmacists, pharmacy technicians and pharmacies in Great Britain. They assure and improve standards of care for people using pharmacy services.<\/p><p><a href=\"https:\/\/www.pharmacyregulation.org\/\"><span style=\"text-decoration:underline\">https:\/\/www.pharmacyregulation.org\/<\/span><\/a><\/p><p>ICO – Information Commissioner’s Office<\/p><p>The UK’s independent authority set up to uphold information rights in the public interest, promoting openness by public bodies and data privacy for individuals.<\/p><p>Welzo is registered with the Information Commissioners Office under Reference number <strong>ZB356504<\/strong>.<\/p>"}}},"block_order":["template--15775868125277__d69501c2-f17b-4526-bcc9-73d31895ba73-heading-1","template--15775868125277__d69501c2-f17b-4526-bcc9-73d31895ba73-text-1"],"settings":{"padding_top":40,"padding_bottom":52}},"04022edd-1a86-42b8-932a-be2e7a68c73b":{"type":"health","blocks":{"template--14895778168925__04022edd-1a86-42b8-932a-be2e7a68c73b-1670524477a841c227-0":{"type":"column","settings":{"title":"Covid 19 Test","link":"","product":""}}},"block_order":["template--14895778168925__04022edd-1a86-42b8-932a-be2e7a68c73b-1670524477a841c227-0"],"disabled":true,"settings":{"image_photo":"shopify:\/\/shop_images\/woman-doctor-wearing-lab-coat-with-stethoscope-isolated_1.jpg","is_left":false,"title":"UKAS & CQC Registered Labs","heading_tag":"h1","text":"<p>Welzo has over eight different laboratories across the UK, Denmark and Italy. This enables us to cover a vast range of diagnostic tests, genetic tests, epigenetic tests and standard biomarkers.<br\/>All labs in the UK are both CQC and UKAS registered. In addition to this, our international labs also hold ISO accreditations.<\/p>","padding_top":36,"padding_bottom":36}}},"order":["16551852697ebd58a0","d69501c2-f17b-4526-bcc9-73d31895ba73","04022edd-1a86-42b8-932a-be2e7a68c73b"]}